## SQLite-tehtävät

#### Tehtävä 1. Lisää tarvittavat kirjastot ja tee `testi.db` niminen tietokanta (SQLite3)

In [2]:
import sqlite3
import pandas as pd
from sqlalchemy import create_engine

In [3]:
tietokanta = sqlite3.connect("testi.db")
yhteys = tietokanta.cursor()

#### Tehtävä 2. Luo yhteys tietokantaan

In [4]:
tietokanta

#### Tehtävä 3. Tee tietokantaan seuraavanlainen taulu, jonka nimi on `henkilotaulu`:
    
| Nimi        | Ika           | Kengankoko  |
| ------------- |-------------| -----|
| Teppo      | 88 | 47 |
| Matti      | 34     | 39 |
| Ilona | 41      |    36 |
| Sonja | 32      |    37 |

In [5]:
tietokanta = sqlite3.connect("henkilotaulu.db")

tietokanta.execute("CREATE TABLE IF NOT EXISTS henkilotaulu(Nimi TEXT, Ika INTEGER, Kengankoko INTEGER)")

data_rows = [("Teppo", 88, 47), ("Matti", 34, 39), ("Ilona", 41, 36), ("Sonja", 32, 37),
             ("Teppo", 88, 47), ("Matti", 34, 39), ("Ilona", 41, 36), ("Sonja", 32, 37),
             ("Teppo", 88, 47), ("Matti", 34, 39), ("Ilona", 41, 36), ("Sonja", 32, 37)]

for row in data_rows:
    tietokanta.execute("INSERT INTO henkilotaulu VALUES (?, ?, ?)", row)

tietokanta.commit()

query = "SELECT * FROM henkilotaulu"
df = pd.read_sql_query(query, tietokanta)

df_no_duplicates = df.drop_duplicates()

hatunkoko_df = pd.DataFrame(df_no_duplicates)

tietokanta.commit()

hatunkoko_df

    Nimi  Ika  Kengankoko
0  Teppo   88          47
1  Matti   34          39
2  Ilona   41          36
3  Sonja   32          37

#### Tehtävä 4. Kun Taulu on tehty, niin hae taulu Pandasin DataFrame-objektiin ja lisää siihen sarake `Hatunkoko`, jonka jälkeen täytä se valitsemillasi arvoilla

In [7]:
df = pd.DataFrame(df_no_duplicates)

df_no_duplicates["Hatunkoko"] = [4,5,6,7]
    
df_no_duplicates

    Nimi  Ika  Kengankoko  Hatunkoko
0  Teppo   88          47          4
1  Matti   34          39          5
2  Ilona   41          36          6
3  Sonja   32          37          7

#### Tehtävä 5. Tee DataFrame-objektista kopio, jonka nimi on `henkilotaulukopio` ja lisää siihen rivi valitsemillasi arvoilla. Tallenna tämä muokattu dataframe-objekti nyt tietokantaan nimellä `henkilotaulukopio` (tulee edellisen taulun rinnalle).

In [10]:
df_no_duplicates = pd.read_sql_query("SELECT * FROM df_no_duplicates", tietokanta)

df_no_duplicates = df_no_duplicates[df_no_duplicates['Nimi'] != 'Tarja']

df_no_duplicates.to_sql(name="df_no_duplicates", con=tietokanta, if_exists='replace', index=False)

tietokanta.commit()

henkilotaulukopio = pd.read_sql_query("SELECT * FROM henkilotaulukopio", tietokanta)

vanha_df = pd.DataFrame(df_no_duplicates)
uusi_df = pd.DataFrame(henkilotaulukopio)

vanha_df
uusi_df

#En ymmärrä minkä takia se ei tulosta DataFrame objekteja vierekkäin,
#mutta jos niitä kokeilee yksitellen ne tulostuvat hienosti pd.DataFrame objekteina.
#Tämän takia olen laittanut useampaan paikkaan tietokanta.commit()
#jospa se kyseinen df_no_duplicates tallentuu tietokantaan.
#En ole löytänyt syytä mutta yksitellen ne tulostuvat DataFrame objekteina.

    Nimi  Ika  Kengankoko  Hatunkoko
0  Teppo   88          47          4
1  Matti   34          39          5
2  Ilona   41          36          6
3  Sonja   32          37          7
4  Tarja   55          35          8

#### Tehtävä 6. Tallenna lopuksi tietokannan muutokset ja sulje yhteys

In [187]:
tietokanta.commit()

tietokanta.close()